
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	//Если ЗначениеЗаполнено(ПараметрКоманды.Ссылка)  Тогда
	Если ЗначениеЗаполнено(ПараметрКоманды)  Тогда
		//СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Источник, Форма, ФормаУИ, ФормаНавигацСсылка");
//		ПараметрыФормы.Источник = ПараметрКоманды.Ссылка;
		ПараметрыФормы.Источник = ПараметрКоманды;
		//ПараметрыФормы.КатегорияЗадачи = ПараметрКоманды.КатегорияЗадачи; 
		//ПараметрыФормы.ОбъектМетаданных = ПараметрКоманды.Ссылка; 
		Владелец = ПараметрыВыполненияКоманды.Источник;
		ПараметрыФормы.ФормаУИ = Владелец.УникальныйИдентификатор;
		ПараметрыФормы.ФормаНавигацСсылка = ПараметрыВыполненияКоманды.НавигационнаяСсылка;
		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
		
		//ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
		
		ИмяОбработки = "ПроизвольнаяНумерацияОбъектов";
		//ИмяОбработки = "ИзменениеФормы";
		
		ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
		ИмяФормы = ".Форма.Форма";
		
		ИмяМетода = "СформироватьСтруктурыДанных";
		
		//СтруктураПараметров = Новый Структура("Источник", ПараметрКоманды.Ссылка);
		СтруктураПараметров = Новый Структура("Источник", ПараметрКоманды);
		
		Данные = ЗаполнитьДанные(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров);
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды.Источник.Объект, Данные); 
		 
	КонецЕсли; 
		
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
 
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ЗаполнитьДанные(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров)
 
	ВнешняяОбработка = asur_Сервер.ПолучитьВнешнююОбработку(ИмяОбработки, ПутьКФайлу);	
	

	//Результат = Выполнить("ВнешняяОбработка." + ИмяМетода + "(" + СтруктураПараметров + ")");
	Результат = ВнешняяОбработка.СформироватьСтруктурыДанных(СтруктураПараметров);
	//(СтруктураПараметров);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьДанные()
