
&НаСервере
Процедура СоздатьВнешнююОработку(Путь)  Экспорт
	
	ВнешняяОбработка =  ВнешниеОбработки.Создать(Путь, Ложь);
	
КонецПроцедуры


// Возвращает по имени внешнюю обработку по указанному пути
//
// Параметры:
//  ИмяОбработки  - Строка - Имя обработки
//  ПутьКФайлу  - Строка - Путь в файловом менеджере
//
&НаСервере
Функция ПолучитьВнешнююОбработку(ИмяОбработки, ПутьКФайлу) 	Экспорт
	
	ПутьКВнешнейОбработки = ПутьКФайлу + "\" + ИмяОбработки + ".epf";

	Возврат  ВнешниеОбработки.Создать(ПутьКВнешнейОбработки, Ложь);
	
КонецФункции
