
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Объект.Год = НачалоГода(ТекущаяДата());
	Объект.Исполнитель = Пользователи.ТекущийПользователь();
	Объект.ДатаСозданияЗадачи = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура КатегоряЗадачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
//		СтандартнаяОбработка = Ложь;
//		ПараметрыФормы = Новый Структура("ТипОбъектаМетаданных", Объект.Ссылка); 
//		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
//		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
////		ОткрытьФорму("РегистрСведений.гс_РеквизитыОбъектовМДХранящиеИсторию.Форма.ФормаЗаписиСОтбором", ПараметрыФормы, ЭтаФорма,,,,ОписаниеЗакрытия,РежимОткрытия);
//		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

//	КонецЕсли; 
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КатегоряЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКатегорию(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ, ОбъектМетаданных", Объект.КатегоряЗадачи, Объект.Ссылка); 
		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

	КонецЕсли; 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти