
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Год)  Тогда
		Объект.Год = asur_ПолучениеДанных_ПовтИсп.ТекущийГод();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Исполнитель)  Тогда
		Объект.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСозданияЗадачи)  Тогда
		Объект.ДатаСозданияЗадачи = ТекущаяДата();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Организация)  Тогда
		Объект.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""ГорСети""");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьФорму" Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, Параметр); 
		ЭтаФорма.Прочитать(); 
		//ЭтаФорма.ОбновитьОтображениеДанных(Элементы.Найти("ГруппаДанныхПроизвольнойНумерации"));
		//ОбновитьИнтерфейс();  
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КатегоряЗадачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
//		СтандартнаяОбработка = Ложь;
//		ПараметрыФормы = Новый Структура("ТипОбъектаМетаданных", Объект.Ссылка); 
//		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
//		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
////		ОткрытьФорму("РегистрСведений.гс_РеквизитыОбъектовМДХранящиеИсторию.Форма.ФормаЗаписиСОтбором", ПараметрыФормы, ЭтаФорма,,,,ОписаниеЗакрытия,РежимОткрытия);
//		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

//	КонецЕсли; 
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КатегоряЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКатегорию(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ, ОбъектМетаданных", Объект.КатегорияЗадачи, Объект.Ссылка); 
		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
		ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);

	КонецЕсли; 
КонецПроцедуры

&НаКлиенте

Процедура МестоВыполненияЗадачиПриИзменении(Элемент)
	Объект.ВерсияКонфигурации = asur_ПолучениеДанных.ПоследняяВерсияКофигурации(
					Объект.Организация,
					Объект.МестоВыполненияЗадачи,
					?(ЗначениеЗаполнено(Объект.ДатаНачалаЗадачи), Объект.ДатаНачалаЗадачи, ТекущаяДата())); 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ИмяОбработки = "ПроизвольнаяНумерацияОбъектов";
	//ИмяОбработки = "ИзменениеФормы";
	
	ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
	
	ИмяМетода = "СформироватьСтруктурыДанных";
	
	СтруктураПараметров = Новый Структура("Источник", Объект.Ссылка);
	
	Данные = ЗаполнитьДанныеНаСервере(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров);
	
	ЗаполнитьЗначенияСвойств(Объект, Данные); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьДанныеНаСервере(ИмяОбработки, ПутьКФайлу, ИмяМетода, СтруктураПараметров)
 
	ВнешняяОбработка = asur_Сервер.ПолучитьВнешнююОбработку(ИмяОбработки, ПутьКФайлу);	
	

	//Результат = Выполнить("ВнешняяОбработка." + ИмяМетода + "(" + СтруктураПараметров + ")");
	Результат = ВнешняяОбработка.СформироватьСтруктурыДанных(СтруктураПараметров);
	//(СтруктураПараметров);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьДанные()


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти