

// Открывает по имени внешнюю обработку по указанному пути
//
// Параметры:
//  ИмяОбработки  - Строка - Имя обработки
//  ПутьКФайлу  - Строка - Путь в файловом менеджере
//  ИмяФормы  - Строка - Имя открываемой формы  
//				Пример ".Форма.Форма"
//  ПараметрыФормы  - Структура - Параметры открытия формы
//
&НаКлиенте
Процедура ЗапуститьВнешнююОбработку(ИмяОбработки, ПутьКФайлу, ИмяФормы, ПараметрыФормы, Владелец) 	Экспорт
	//Заполнить свои параметры внешней обработки
	//ИмяОбработки = "ПроизвольнаяНумерацияОбъектов";
	//ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкна",ЭтотОбъект);
	
	
	ПутьКВнешнейОбработки = ПутьКФайлу + "\" + ИмяОбработки + ".epf";

	//Создание и открытие вн. обработки
	asur_Сервер.СоздатьВнешнююОработку(ПутьКВнешнейОбработки);
	
	ОткрытьФорму("ВнешняяОбработка."+ ИмяОбработки + ИмяФормы, ПараметрыФормы, Владелец,,,,ОповещениеОЗакрытии,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкна(ПарамЗакрытия, Структура)   Экспорт

	

КонецПроцедуры
 