
// <Описание функции>
//
// Параметры:
//  Организация  - Ссылка.Организация - Ссылка на организацию
//  Конфигурация  - Ссылка.asur_КонфигурацииОрганизации - 
//  Дата  - Дата получения данных
//
// Возвращаемое значение:
//   Ссылка.asur_ВерсииКонфигурации -  Версия Конфигурации на переданную дату
Функция ПоследняяВерсияКофигурации(Организация, Конфигурация, Дата)   Экспорт

	ПарамОтбора = Новый Структура("Организация, Конфигурация", Организация, Конфигурация);
	Возврат РегистрыСведений.asur_ТекущаяВерсияКонфигурации.ПолучитьПоследнее(Дата, ПарамОтбора).ТекущаяВерсия;

КонецФункции // ПоследняяВерсияКофигурации()
 