
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	//Если ЗначениеЗаполнено(ПараметрКоманды.Ссылка)  Тогда
	
	Если ЗначениеЗаполнено(ПараметрКоманды)  Тогда
		//СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("Источник, Форма, ФормаУИ, ФормаНавигацСсылка");
		//ПараметрыФормы.Источник = ПараметрКоманды.Ссылка;
		ПараметрыФормы.Источник = ПараметрКоманды;
		
		//ПараметрыФормы.КатегорияЗадачи = ПараметрКоманды.КатегорияЗадачи; 
		
		//ПараметрыФормы.ОбъектМетаданных = ПараметрКоманды.Ссылка; 
		Владелец = ПараметрыВыполненияКоманды.Источник;
		ПараметрыФормы.ФормаУИ = Владелец.УникальныйИдентификатор;
		ПараметрыФормы.ФормаНавигацСсылка = ПараметрыВыполненияКоманды.НавигационнаяСсылка;
		//РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		//ОписаниеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияЗаписи", ЭтотОбъект);
		
		//ОткрытьФорму("Справочник.asur_КатегорииЗадач.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
		
		ИмяОбработки = "ПроизвольнаяНумерацияОбъектов";
		
		ПутьКФайлу = "D:\1С Труд\! Разработка\kps_ASUR\ПроизвольнаяНумерацияОбъектов";
		ИмяФормы = ".Форма.ФормаНастройкиНумерации";
		
		asur_ИнтерфейсныеМеханизмы.ЗапуститьВнешнююОбработку(ИмяОбработки, ПутьКФайлу, ИмяФормы, ПараметрыФормы, Владелец);
		
		
	КонецЕсли; 
		
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
 
